# StairsComponentJoinFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsComponentJoinFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't keep elements joined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsComponentJoinFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsComponentJoinFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace